app/controllers/people_controller.rb

  def index
    @people = Person.all.order('people.last_name')
---
SELECT "people".* FROM "people"   ORDER BY people.last_name